Repository: Helltar/gcencryptor
Catalog: locale/gcencryptor.*.po
Languages: es, ru, uk

source: About
es: Acerca de
ru: О Программе
uk: Про програму

# tfrmabout.lbllicense.caption
source: License: GNU General Public License v3.0
es: Licencia: GNU General Public License v3.0

source: &Cancel
es: &Cancelar
ru: &Отмена

source: &Yes
es: &Sí
ru: &Да

source: Please confirm
es: Por favor, confirme
ru: Пожалуйста, подтвердите

source: This action not have any risk corrupted the data, if the vault is busy you will get a message.
es: Esta acción no tiene ningún riesgo de corrupción de los datos, si el almacén está ocupado, recibirá un mensaje.
ru: Это действие не несет никакого риска повреждения данных, если хранилище занято, вы получите сообщение.

source: Unmount all and quit application?
es: ¿Desmontar todo y salir de la aplicación?
ru: Размонтировать все и выйти из приложения?

source: There are unlocked vaults:
es: Hay almacenes desbloqueados:
ru: Есть незапертые хранилища:

source: GNU GENERAL PUBLIC LICENSE
es: LICENCIA PÚBLICA GENERAL DE GNU

source: C&lear
es: B&orrar
ru: &Очистить

source: &Close
es: &Cerrar
ru: &Закрыть
uk: &Закрити

# tfrmlog.btnsavelog.caption
source: &Save to file
es: &Guardar en archivo
ru: &Сохранить в файл
uk: З&берегти у файл

source: Messages
es: Mensajes
ru: Сообщения
uk: Повідомлення

# tfrmmain.actconfigure.caption
source: &Configure gcencryptor ...
es: &Configurar gcencryptor ...
ru: &Настроить gcencryptor ...
uk: &Налаштувати gcencryptor ...

# tfrmmain.actcreatevault.caption
source: Create &New Vault ...
es: Crear &Nuevo Almacén ...
ru: Создать &новое хранилище ...
uk: Створити &нове сховище ...

# tfrmmain.actdelfromlist.caption
source: &Delete From List
es: &Eliminar de la Lista
ru: &Удалить из списка
uk: Ви&далити зі списку

# tfrmmain.actfsck.caption
source: &Check Integrity ...
es: &Comprobar Integridad ...
ru: &Проверить целостность ...
uk: &Перевірити цілісність ...

# tfrmmain.acthidemenubar.caption
source: Show &Menubar
es: Mostrar &Barra de Menú
ru: Показывать &меню
uk: Показувати &меню

# tfrmmain.actlock.caption
source: Lock
es: Bloquear
ru: Заблокировать
uk: Заблокувати

source: Lock Selected Vault
es: Bloquear Almacén Seleccionado
ru: Заблокировать выбранное хранилище
uk: Заблокувати вибране сховище

# tfrmmain.actlockall.caption
source: Lock All
es: Bloquear Todo
ru: Заблокировать все
uk: Заблокувати все

source: Lock All Unlocked Vaults
es: Bloquear Todos los Almacenes Desbloqueados
ru: Заблокировать все незапертые хранилища
uk: Заблокувати всі розблоковані сховища

source: &Open Mounted Directory ...
es: Abrir Directorio Montado ...
ru: &Открыть смонтированный каталог ...
uk: &Відкрити змонтований каталог ...

source: Decrypted Directory
es: Directorio Desencriptado
ru: Расшифрованный каталог
uk: Розшифрований каталог

# tfrmmain.actopenvault.caption
source: &Open Existing Vault ...
es: Abrir Almacén &Existente ...
ru: &Открыть существующие хранилище ...
uk: &Відкрити наявне сховище ...

source: Open &Vault Directory ...
es: Abrir Directorio del Almacén ...
ru: Открыть каталог &хранилища ...
uk: Відкрити каталог &сховища ...

source: Encrypted Directory
es: Directorio Encriptado
ru: Зашифрованный каталог
uk: Зашифрований каталог

# tfrmmain.actunlock.caption
source: Unlock
es: Desbloquear
ru: Разблокировать
uk: Розблокувати

source: Unlock Selected Vault
es: Desbloquear Almacén Seleccionado
ru: Разблокировать выбранное хранилище
uk: Розблокувати вибране сховище

# tfrmmain.actvaultinfo.caption
source: &Information
es: &Información
ru: &Информация
uk: &Інформація

# tfrmmain.cbreadonlymount.caption
source: Mount read-only
es: Montar solo lectura
ru: Смонтировать только для чтения
uk: Монтувати лише для читання

# tfrmmain.gbcurrentvault.caption
source: Vault
es: Almacén
ru: Хранилище
uk: Сховище

source: &About
es: Acerca de
ru: О &Программе
uk: &Про програму

source: &English
es: Inglés
ru: &Английский
uk: &Англійська

# tfrmmain.miexit.caption
source: &Quit
es: Salir
ru: &Выйти
uk: В&ийти

source: &Help
es: Ayuda
ru: &Справка

source: &Language
es: Idioma
ru: &Язык
uk: &Мова

source: &Lock All Vaults
es: Bloquear Todos los Almacenes
ru: &Заблокировать все хранилища
uk: &Заблокувати всі сховища

# tfrmmain.miquittray.caption
source: &Quit
es: Salir
ru: &Выйти
uk: &Вийти

source: &Russian
es: Ruso
ru: &Русский
uk: &Російська

source: &Settings
es: Configuración
ru: &Настройки
uk: &Налаштування

# tfrmmain.mishowformtray.caption
source: &Toggle window
es: Alternar ventana
ru: &Переключить окно
uk: &Переключити вікно

source: &Spanish
es: &Español

source: &Ukrainian
es: Ucraniano
ru: &Украинский
uk: &Українська

source: &Vault
es: Almacén
ru: &Хранилище
uk: &Сховище

source: Select An Encrypted Vault Directory
es: Seleccionar un Directorio de Almacén Encriptado
ru: Выберите зашифрованный каталог
uk: Виберіть Зашифрований каталог сховища

# tfrmmasterkey.btnok.caption
source: &OK
es: &Aceptar

# tfrmmasterkey.btnsave.caption
source: &Save to file
es: &Guardar en archivo
ru: &Сохранить в файл
uk: &Зберегти у файл

source: Recovery Master Key
es: Clave Maestra de Recuperación
ru: Мастер-ключ для восстановления
uk: Майстер-ключ відновлення

source: Your master key is:
es: Tu clave maestra es:
ru: Ваш мастер-ключ:
uk: Ваш головний ключ:

source: If the gocryptfs.conf file becomes corrupted or you ever forget your password, there is only one hope for recovery: The master key. Print it to a piece of paper and store it in a drawer. This message is only printed once.
es: Si el archivo gocryptfs.conf se corrompe o alguna vez olvidas tu contraseña, solo hay una esperanza de recuperación: la clave maestra. Imprímela en un papel y guárdala en un cajón. Este mensaje solo se imprime una vez.
ru: Если файл gocryptfs.conf поврежден или вы забыли пароль, есть только одна надежда на восстановление: Главный ключ. Распечатайте его на листе бумаги и храните в ящике. Это сообщение печатается только один раз.
uk: Якщо файл gocryptfs.conf буде пошкоджено або ви забудете свій пароль, є лише одна надія на відновлення: майстер-ключ. Роздрукуйте його на папері і зберігайте в шухляді. Це повідомлення друкується лише один раз.

source: &Create Vault
es: Crear Almacén
ru: &Создать хранилище
uk: &Створити сховище

source: New Vault
es: Nuevo Almacén
ru: Новое хранилище
uk: Нове сховище

source: Advanced Settings
es: Configuración Avanzada
ru: Расширенные настройки

source: Do not encrypt file names and symlink targets
es: No encriptar nombres de archivo y objetivos de enlace simbólico
ru: Не шифровать имена файлов и симлинков

source: password
es: contraseña
ru: пароль
uk: пароль

# tfrmnewvault.edtpath.texthint
source: path
es: ruta
ru: путь
uk: шлях

source: confirm password
es: confirmar contraseña
ru: подтвердите пароль
uk: підтвердити пароль

source: vault name
es: nombre del almacén
ru: название
uk: назва сховища

source: Hash file names that (in encrypted form) exceed this length. The default is 255, which aligns with the usual name length limit on Linux and provides best performance. However, online storage may impose lower limits on file name and/or path length. In this case, setting -longnamemax to a lower value can be helpful. The lower the value, the more extra .name files must be created, which slows down directory listings. Values below 62 are not allowed as then the hashed name would be longer than the original name.
es: Hash los nombres de archivo que (en forma encriptada) superen esta longitud. El valor predeterminado es 255, que se alinea con el límite de longitud de nombre habitual en Linux y proporciona el mejor rendimiento. Sin embargo, el almacenamiento en línea puede imponer límites más bajos en la longitud del nombre de archivo y/o la ruta. En este caso, establecer -longnamemax en un valor más bajo puede ser útil. Cuanto menor sea el valor, más archivos .name adicionales se deben crear, lo que ralentiza las listas de directorios. No se permiten valores inferiores a 62, ya que el nombre hash sería más largo que el nombre original.
ru: Хеширование имен файлов, которые (в зашифрованном виде) превышают эту длину. По умолчанию установлено значение 255, что соответствует обычному ограничению длины имени в Linux и обеспечивает наилучшую производительность. Однако облачные хранилища могут устанавливать более низкие ограничения на длины имени файла и/или пути. В этом случае может быть полезно установить -longnamemax на более низкое значение. Чем меньше значение, тем больше дополнительных файлов .name должно быть создано, что замедляет листинг каталогов. Значения ниже 62 не допускаются, так как в этом случае хэшированное имя будет длиннее, чем оригинальное имя.

# tfrmpassword.btnok.caption
source: &Unlock
es: &Desbloquear
ru: &Разблокировать

source: Show Password
es: Mostrar Contraseña
ru: Показать пароль
uk: Показати пароль

source: Password:
es: Contraseña:
ru: Пароль:
uk: Пароль:

source: &Create Desktop Entry
es: Crear Acceso Directo al Escritorio
ru: Создать &ярлык приложения
uk: &Створити ярлик програми

source: &Save
es: Guardar
ru: &Сохранить
uk: &Зберегти

source: Open in File Manager after unlocking
es: Abrir en el Administrador de Archivos después de desbloquear
ru: Открыть в диспетчере файлов после разблокировки
uk: Відкривати у менеджері файлів після розблокування

source: Clear clipboard after unlocking
es: Borrar portapapeles después de desbloquear
ru: Очистить буфер обмена после разблокировки

source: Generate long name for mount point
es: Generar nombre largo para el punto de montaje
ru: Генерировать длинное название для точки монтирования
uk: Генерувати довгу назву для точки монтування

source: VAULTNAME_6F9619FF-8B86-D011-B42D-00CF4FC964FF
es: NOMBREDEALMACÉN_6F9619FF-8B86-D011-B42D-00CF4FC964FF

source: Hide window to system tray when close
es: Ocultar ventana en la bandeja del sistema al cerrar
ru: Скрывать окно в системный трей при закрытии
uk: Приховувати вікно в системній трей під час закриття

# tfrmsettings.edtmountpoint.texthint
source: path
es: ruta
ru: путь
uk: шлях

source: Settings
es: Configuración
ru: Настройки

source: Font size (messages)
es: Tamaño de fuente (mensajes)
ru: Размер шрифта (сообщения)
uk: Розмір шрифту (повідомлення)

source: Mount Directory:
es: Directorio de Montaje:
ru: Каталог монтирования:
uk: Каталог монтування:

source: Maybe %s is not installed
es: Tal vez %s no está instalado
ru: Возможно, %s не установлен
uk: Можливо, %s не встановлено

# uconsts.rs_caption_warning
source: Warning
es: Advertencia
ru: Предупреждение
uk: Увага

# uconsts.rs_created_successfully
source: The gocryptfs filesystem has been created successfully
es: El sistema de archivos gocryptfs se ha creado correctamente
ru: Файловая система gocryptfs была успешно создана
uk: Файлову систему gocryptfs успішно створено

source: Desktop entry created
es: Acceso directo al escritorio creado
ru: Ярлык успешно создан
uk: Ярлик успішно створений

# uconsts.rs_directory_exists
source: Directory already exists
es: El directorio ya existe
ru: Каталог уже существует
uk: Каталог уже існує

# uconsts.rs_directory_not_exists
source: Directory not exists
es: El directorio no existe
ru: Каталога не существует
uk: Каталог не існує

# uconsts.rs_error_creating_directory
source: Error creating the directory
es: Error al crear el directorio
ru: Ошибка при создании каталога
uk: Помилка створення каталогу

# uconsts.rs_error_del_directory
source: Error deleting the directory
es: Error al eliminar el directorio
ru: Ошибка при удалении каталога
uk: Помилка видалення каталогу

# uconsts.rs_error_load_config
source: Error load config
es: Error al cargar la configuración
ru: Ошибка при загрузке конфигурации
uk: Помилка завантаження конфігурації

# uconsts.rs_error_run_executable
source: failed to run
es: no se pudo ejecutar
ru: не удалось запустить
uk: не вдалося запустити

# uconsts.rs_error_wrong_password
source: Error, something went wrong reading the password
es: Error, algo salió mal al leer la contraseña
ru: Ошибка, что-то пошло не так при чтении пароля
uk: Помилка, щось пішло не так під час читання пароля

# uconsts.rs_err_save_key
source: Error when saving key
es: Error al guardar la clave
ru: Ошибка при сохранении ключа
uk: Помилка під час збереження ключа

# uconsts.rs_failed_to_retrieve_recovery_key
source: Vault was successfully created, but could not retrieve the recovery key
es: El almacén se creó correctamente, pero no se pudo recuperar la clave de recuperación
ru: Хранилище было успешно создано, но не удалось получить ключ восстановления
uk: Сховище успішно створено, але не вдалося отримати ключ відновлення

# uconsts.rs_failed_to_save_log_file
source: Failed to save log file
es: Error al guardar el archivo de registro
ru: Не удалось сохранить файл журнала
uk: Не вдалося зберегти файл журналу

# uconsts.rs_fsck_no_problems_found
source: fsck summary: no problems found
es: Resumen de fsck: no se encontraron problemas
ru: fsck: проблем не обнаружено
uk: fsck: проблем не знайдено

# uconsts.rs_gb_vault_caption
source: Vault
es: Almacén
ru: Хранилище
uk: Сховище

source: This is not critical, but you will not be able to get the master key when you create a new vault
es: Esto no es crítico, pero no podrás obtener la clave maestra al crear un nuevo almacén
ru: Это не критично, но вы не сможете получить мастер-ключ при создании нового хранилища
uk: Це не критично, але ви не зможете отримати головний ключ під час створення нового сховища

# uconsts.rs_key_saved
source: Key successfully saved
es: Clave guardada correctamente
ru: Ключ успешно сохранен
uk: Ключ успішно збережено

# uconsts.rs_lock_all_and_close
source: Lock all and close?
es: ¿Bloquear todo y cerrar?
ru: Заблокировать все и закрыть?
uk: Заблокувати все і закрити?

source: Available only on gocryptfs >= v2.3
es: Disponible solo en gocryptfs >= v2.3
ru: Доступно только на gocryptfs версии >= 2.3

# uconsts.rs_mountpoint_hint
source: During the mount, directories with the storage name will be temporarily created in this directory, for example:
es: Durante el montaje, se crearán temporalmente directorios con el nombre de almacenamiento en este directorio, por ejemplo:
ru: Во время монтирования в этом каталоге будут временно созданы каталоги с именем хранилища, например:
uk: Під час монтування в цьому каталозі буде тимчасово створено каталоги з назвою сховища, наприклад:

# uconsts.rs_passwords_do_not_match
source: Passwords do not match
es: Las contraseñas no coinciden
ru: Пароли не совпадают
uk: Паролі не співпадають

# uconsts.rs_password_empty
source: Password Empty
es: Contraseña Vacía
ru: Пустой пароль
uk: Пароль порожній

# uconsts.rs_password_incorrect
source: Password Incorrect
es: Contraseña Incorrecta
ru: Неверный пароль
uk: Невірний пароль

# uconsts.rs_please_wait_until_the_process
source: Please wait until the process is completed it may take some time ...
es: Por favor, espere hasta que se complete el proceso, puede llevar algún tiempo ...
ru: Пожалуйста, подождите пока процесс завершится, это может занять некоторое время ...
uk: Зачекайте, доки процес завершиться, це може зайняти деякий час ...

# uconsts.rs_successfully_mounted
source: Filesystem mounted and ready
es: Sistema de archivos montado y listo
ru: Файловая система смонтирована и готова к использованию
uk: Файлова система змонтована та готова до використання

# uconsts.rs_unmounted_successfully
source: Unmounted successfully
es: Desmontado correctamente
ru: Успешно отсоединено
uk: Успішно відключено

# uconsts.rs_vaultpath_hint
source: Open in File Manager ...
es: Abrir en el Administrador de Archivos ...
ru: Открыть в диспетчере файлов ...
uk: Відкрити в менеджері файлів ...

# tfrmclosequery.btncancel.caption
source: &Cancel
uk: &Скасувати

# tfrmclosequery.btnyes.caption
source: &Yes
uk: &Так

# tfrmclosequery.caption
source: Please confirm
uk: Будь-ласка підтвердіть

# tfrmclosequery.lblinfo.caption
source: This action not have any risk corrupted the data, if the vault is busy you will get a message.
uk: Ця дія не має ризику пошкодження даних, якщо сховище зайняте, ви отримаєте повідомлення.

# tfrmclosequery.lblq.caption
source: Unmount all and quit application?
uk: Відмонтувати все та вийти з програми?

# tfrmclosequery.lblunlockedvaults.caption
source: There are unlocked vaults:
uk: Є розблоковані сховища:

# tfrmlog.btnclear.caption
source: C&lear
uk: &Очистити

# tfrmsettings.gbmain.caption
source: Settings
uk: Налаштування
